Get a copy of the section box.
  Namespace:   Autodesk.Revit.DB
  Assembly:   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
 Syntax
  C#
public BoundingBoxXYZ GetSectionBox()
  Visual Basic
Public Function GetSectionBox As BoundingBoxXYZ
  Visual C++
public:
BoundingBoxXYZ^ GetSectionBox()
 Return Value
 The section box.
 Remarks
 The section box cuts the model by the bounds of the box. To turn off section box, pass in    a null reference (  Nothing  in Visual Basic)  or a disabled box. Individual bound enabled flags are currently ignored.
 Exceptions
  Exception  |   Condition
   Autodesk.Revit.Exceptions InvalidOperationException   |   View cannot be a template view.
 See Also
  View3D Class
  Autodesk.Revit.DB Namespace